INSERT INTO tags (id, category_id, parent_id, name, slug, is_selectable, featured_rank)
VALUES (439, 1, 17, '피자', 'western-pizza', 1, NULL);

INSERT INTO restaurants (id, name, address, location_link, latitude, longitude, location_tag_id, uploaded_by, rating, summary, description, price_min, price_max, created_at) VALUES
(32, '육장정', NULL, 'https://place.map.kakao.com/309142826', 37.51056259, 127.1088392, 23, 4, 4, '갈비 4대와 꼬들한 면은 라면을 먹으면서 부자가 된 기분을 느끼게 해준다. 마지막에 기름기를 완벽히 날려주는 자몽이 있다.\n\n송리단길이라는 단어와 뭔가 어울리지 않는 육개장집. 갈비 4대와 꼬들한 면은 라면을 먹으면서 부자가 된 기분을 느끼게 해준다. 마지막에 기름기를 완벽히 날려주는 자몽은 사장님 부부의 센스를 느끼게 해주는 디테일이다.', '육개장', 10000, 14000, NULL),
(33, '꼬따', NULL, 'https://place.map.kakao.com/143081516', 37.50736402, 127.1145552, 23, 4, 4, '화덕에서 구워 빵에서 불향이 남\n\n이탈리아에서 피자를 배워오신 사장님이 화덕에서 구워주시는 진짜 나폴리 피자. 빵에서 계속 불향이 나서 엣지까지 재미있는 피자였습니다', '나폴리 피자', 10000, 14000, NULL),
(34, '산월수제비', NULL, 'https://place.map.kakao.com/16271793', 37.4953432, 127.0639369, 21, 4, 4, '멸치베이스에 딱 밀가루 반죽으로 칼국수랑 수제비를 넣은 정말 기본적인 배치지만 딱 기본에 충실하게 먹고 싶을때 가기 좋습니당.', NULL, 10000, 14000, NULL),
(35, '강남교자칼국수', '서울 서초구 강남대로69길 11 삼미빌딩', 'https://place.map.kakao.com/11891754', 37.50145964, 127.0241926, 22, 4, 4, '명동교자에 비해 더 깔끔한 맛이 일품입니다', NULL, 10000, 14000, NULL),
(36, '임병주산동칼국수', '서울 서초구 강남대로37길 65', 'https://place.map.kakao.com/25038356', 37.48456983, 127.0300304, 22, 4, 4, '해산물+채소 베이스라 부담없이 잘 넘어갑니다', NULL, 10000, 14000, NULL),
(37, '베테랑칼국수', '전북 전주시 완산구 경기전길 135', 'https://place.map.kakao.com/15482458', 35.81345582, 127.1514303, 15, 4, 4, '쫄면도 맛있고 칼국수도 무난합니다', NULL, 10000, 14000, NULL),
(38, '백암왕순대', '서울 서초구 사평대로55길 139 미성빌딩', 'https://place.map.kakao.com/9817288', 37.51001637, 127.0200014, 22, 4, 4, '국물이 깔끔하고 건더기가 많음.\n\n이투스 정승제T의 최애 순댓국이라는 백암 왕순대. 호기롭게 주문한 얼큰이탕 (특)은 ‘얼큰‘하지는 않았다. 국물이 깔끔하고 건더기가 아주 많은점은 좋았음.', NULL, 10000, 14000, NULL),
(39, '브릭오븐', '서울 강남구 강남대로102길 31 2층', 'https://place.map.kakao.com/19037502', 37.50309869, 127.0277805, 21, 4, 4, '본토 스타일\n\n시험이 끝난것을 기념하여 오랜만에 식당 모임을 가졌습니다. 미국인 형님들의 바이브를 느끼며 본토 스타일의 피자와 지티를 먹었습니다. 그리고 프로슈토 풍기 피자에 도전해주신 부원들께 진심으로 감사드리며 다음에도 맛있는 음식으로 찾아뵙겠습니다.', '프로슈토 풍기', 10000, 14000, NULL),
(40, '비밀베이커리', '서울 송파구 올림픽로 269 프리미엄 롯데슈퍼 지하1층 비밀베이커리', 'https://place.map.kakao.com/1329233080', 37.51442975, 127.1006465, 23, 4, 4, '가성비 샌드위치 맛집 .재료간의 조화가 아주 좋으며, 가벼운 한끼 식사로 추천합니다.\n\n가성비 샌드위치 맛집 ‘비밀 베이커리’입니다. 6-8천원 가격대에서 만원 중반대 샌드위치 퀄리티를 그대로 느낄 수 있는 아주 훌륭한 맛집입니다. 재료간의 조화가 아주 좋으며, 가벼운 한끼 식사로 추천합니다.', NULL, 10000, 14000, NULL),
(41, '원조손칼국수', '서울 성북구 종암로 113 국승호치과의원', 'https://place.map.kakao.com/11486122', 36.37324058, 127.320327, 29, 4, 4, '한식의 강자를 찾기 상당히 어려운 학교 주변 권역에서 묵직한 한방을 가진 맛집입니다.\n\n갈축 끝나는 날 가본 맛집인데 이제서야 소개를 합니다. 한식의 강자를 찾기 상당히 어려운 학교 주변 권역에서 묵직한 한방을 가진 맛집입니다. 전식으로 주시는 동치미국물은 적절히 찬 온도감에 통쾌하다싶은 시원한 맛이 좋습니다. 칼국수의 육수는 사골베이스와 채소의 단맛이 묵직하게 때려박는 일품 그 자체인 맛입니다. 만두는 부추와 고기가 넉넉히 들어있고 (당면 없는걸로 봐서 가게에서 만들었음) 간 또한 타이트해서 좋았습니다.', NULL, 10000, 14000, NULL),
(42, '지우관', '서울 성동구 뚝섬로 427-15 B1층', 'https://place.map.kakao.com/1060315738', 37.53842876, 127.057772, 26, 4, 4, '총평: 잘하는 집은 맞음. 가격대비 만족도 좋음.하지만 회장 본인이 중식에 대한 기준이 매애애우 까다로운 사람이라 회장한테는 soso\n\n성수동의 아주 안쪽에 있는 중화요리집 ‘지우관’에 갔다 왔습니다. 딤섬, 요리, 우육면 등을 파는 곳입니다. 동파육 덮밥은 고추잡채덮밥에서 응용된 야채볶음을 올려주어 식사 자체를 완주하기에는 아주 좋으나 동파육 자체의 맛은 그럭저럭입니다. 딤섬은 유바에다가 새우를 넣은 춘권인데 식감이 재밌고 새우가 제법 많이 들었습니다. 우육면은 고수의 향이 강하고 (그야 제가 고수를 많이 넣어서) 국물이 무난하였습니다.', NULL, 10000, 14000, NULL),
(43, '모터시티', NULL, 'https://place.map.kakao.com/124338573', 37.53396625, 126.9894326, 28, 4, 4, NULL, NULL, 10000, 14000, NULL),
(44, '옷샬', '서울 종로구 창경궁로 236 이화빌딩 2층', 'https://place.map.kakao.com/12740961', 37.47976372, 126.9529991, 30, 4, 3, NULL, NULL, 10000, 14000, NULL),
(45, '이랑칼국수', NULL, 'https://place.map.kakao.com/1708835011', 37.50681463, 127.1085985, 23, 4, 3, NULL, NULL, 10000, 14000, NULL),
(46, '이드', '서울 용산구 우사단로10길 15 1층', 'https://place.map.kakao.com/26533982', 37.53322604, 126.9964248, 28, 4, 3, '한식당', NULL, 10000, 14000, NULL),
(47, '박소린두깜풍', '서울 용산구 보광로59길 9 2층', 'https://place.map.kakao.com/995771109', 37.53385842, 126.9934492, 28, 4, 3, NULL, NULL, 10000, 14000, NULL),
(48, '후르레스토랑', '서울 용산구 우사단로10길 20', 'https://place.map.kakao.com/798069930', 37.53311523, 126.9966375, 28, 4, 3, NULL, NULL, 10000, 14000, NULL),
(49, '핑퐁', '서울 송파구 올림픽로35가길 9 월드마크 푸르지오 1층 135호', 'https://place.map.kakao.com/733399518', 37.52203558, 127.0210725, 23, 4, 3, '일본식 중화요리집', NULL, 10000, 14000, NULL),
(50, '꿰레', '서울 종로구 보문로1길 9 1층 꿰레', 'https://place.map.kakao.com/325095246', 37.57628443, 127.0225504, 24, 4, 3, '안암 근처 타코 제대로 하는 집', NULL, 10000, 14000, NULL),
(51, '벱', '서울 성동구 성수일로4가길 2 1층', 'https://place.map.kakao.com/1079903424', 37.54206337, 127.054008, 26, 4, 3, NULL, NULL, 10000, 14000, NULL),
(52, '머노까머나', '서울 종로구 창경궁로 236 이화빌딩 2층', 'https://place.map.kakao.com/12980859', 37.5825629, 126.9988407, 24, 4, 3, NULL, NULL, 10000, 14000, NULL),
(53, '피프에스프레소바', '서울 중구 충무로4길 3 1층', 'https://place.map.kakao.com/1178169559', 37.56507349, 126.9929801, 24, 4, 3, NULL, NULL, 10000, 14000, NULL),
(54, '줄리아', '서울 중구 수표로 48-12', 'https://place.map.kakao.com/842439367', 37.56550128, 126.9904605, 24, 4, 3, NULL, NULL, 10000, 14000, NULL),
(55, '문화식당', NULL, 'https://place.map.kakao.com/485306026', 37.54230132, 127.0538294, 29, 4, 3, NULL, NULL, 10000, 14000, NULL),
(56, '로마네꽁띠', '서울 종로구 북촌로5나길 83-6 로마네꽁띠', 'https://place.map.kakao.com/8344631', 37.58440322, 126.9823925, 24, 4, 3, NULL, NULL, 10000, 14000, NULL),
(57, 'so far 소파', '서울 성동구 성수일로4길 50 1층', 'https://place.map.kakao.com/613639039', 37.54243003, 127.0541259, 26, 4, 3, NULL, NULL, 10000, 14000, NULL),
(58, '로컬릿', '서울특별시 성동구 한림말길 33, 2층', 'https://place.map.kakao.com/412460362', 37.54093954, 127.0147436, 26, 4, 3, '비건이라는 특성상 한번에 이해하기는 어렵다. 두 번 방문할 각오를 하셔라.\n\n첫 메뉴부터 이들에게 솔직히 난해했다. 후무스는 먹어본 적 있는 이들이였지만 백태콩으로 만든 후무스는 쉽지 않았다. 야채들의 맛이 조화되는 무언가가 느껴지기는 했는데 무언가 이해가 되지 않는 맛이였다.\n\n시금치 뇨끼는 개인적으로 나에게는 감칠맛에 부족하다고 느껴졌다. 평소 접하는 파스타에서는 소스를 낼 때 고기육수를 주되게 쓰거나 동물성 크림을 쓰다보니 그런듯 했다. 시금치를 뭔가 넣고 육수를 쓴 것 같기는 한데...... 많이 아쉬웠다.\n\n비건 삼형제 중에서 호박 까넬로니는 그나마 이해할 수 있었다. 파스타 속 단호박과 당근 소스, 치즈의 조화가 괜찮게 다가왔다. 하지만 이미 두개의 메뉴에서 기대가 꺾인 두 남자들은 그냥저냥 먹었다. 평소의 나처럼 이거라도 이해해보라고 설명을 할 분위기가 아니였다.\n\n라구 리가토니는 비건이 아닌 메뉴였다. 그래서 겁나 맛있었다. 그냥 해치웠다. 그래도 백수저의 클래스가 느껴지는 깊이였다.\n\n암튼 두 남자는 난해한 메뉴를 먹었다. 그들의 첫 비건 식당 탐방은 물음표만을 잔뜩 남기고 끝났다. 그렇게 그들은 물음표를 떠안고 다른 무언가를 먹기 위해 동호대교를 걸었다.\n\n그렇게 커손연 영문표기 논쟁은 시작되었다......', NULL, 10000, 14000, NULL),
(59, '고미태', '서울 마포구 월드컵로 41 1층 고미태', 'https://place.map.kakao.com/1947880008', 37.55300259, 126.9118816, 27, 4, 3, '무언가 철학이 있는 요리를 먹고 싶다면 추천합니디', NULL, 10000, 14000, NULL),
(60, '베델아프리칸레스토랑', '서울 용산구 보광로60길 8', 'https://place.map.kakao.com/1589374106', 37.53389361, 126.9945704, 28, 4, 1, '입맛에 안 맞음. 같이 간 사람 중에 토하러 간 사람도 있음.', NULL, 10000, 14000, NULL);

INSERT INTO restaurant_tags (restaurant_id, tag_id) VALUES
(32, 10), (32, 394), (32, 407),   -- 육장정 (한식, 국물, 면)
(33, 17), (33, 439),              -- 꼬따 (양식, 피자)
(34, 10), (34, 394), (34, 407),   -- 산월수제비 (한식, 국물, 면)
(35, 10), (35, 407),              -- 강남교자칼국수 (한식, 면)
(36, 10), (36, 407),              -- 임병주산동칼국수 (한식, 면)
(37, 10), (37, 407),              -- 베테랑칼국수 (한식, 면)
(38, 10), (38, 394), (38, 431),   -- 백암왕순대 (한식, 국물, 순대)
(39, 18), (39, 439),              -- 브릭오븐 (북미, 피자)
(40, 30), (40, 707), (40, 712),   -- 비밀베이커리 (카페, 베이커리, 샌드위치)
(41, 10), (41, 407),              -- 원조손칼국수 (한식, 면)
(42, 11), (42, 406), (42, 434),   -- 지우관 (중식, 면, 만두)
(43, 18), (43, 439),              -- 모터시티 (북미, 피자)
(44, 13), (44, 435),              -- 옷샬 (인도, 커리)
(45, 10), (45, 407),              -- 이랑칼국수 (한식, 면)
(46, 10), (46, 381),              -- 이드 (한식, 밥)
(47, 14), (47, 403),              -- 박소린두깜풍 (동남아, 면)
(48, 15), (48, 376),              -- 후르레스토랑 (중동, 밥)
(49, 11), (49, 380), (49, 406),   -- 핑퐁 (중식, 밥, 면)
(50, 19), (50, 436),              -- 꿰레 (남미, 타코)
(51, 14), (51, 403),              -- 벱 (동남아, 면)
(52, 13), (52, 435),              -- 머노까머나 (인도, 커리)
(53, 30), (53, 702),              -- 피프에스프레소바 (카페, 커피)
(54, 11), (54, 315), (54, 393),   -- 줄리아 (중식, 고기, 국물)
(55, 17), (55, 22),               -- 문화식당 (양식, 퓨전)
(56, 17), (56, 439),              -- 로마네꽁띠 (양식, 피자)
(57, 30), (57, 702), (57, 713),   -- so far 소파 (카페, 커피, 디저트)
(58, 17), (58, 335), (58, 400),   -- 로컬릿 (양식, 채소, 면)
(59, 12), (59, 405),              -- 고미태 (일식, 면)
(60, 16), (60, 310), (60, 375);   -- 베델아프리칸레스토랑 (아프리카, 고기, 밥)